app/controllers/sessions_controller.rb

  def create
    @teacher = Teacher.find_by(email: session_params["email"])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."email" = $1 LIMIT $2  [["email", "zelma@watsica.com"], ["LIMIT", 1]]