app/controllers/students_controller.rb

  def index
    if logged_in?
      @students = Student.all
      @teacher = Teacher.find(session[:id])
---
SELECT "students".* FROM "students"
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    if logged_in?
      @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]